# 8.5 Пол Анна и Алекс писали контрольную. Пол и Анна получили 4, а Алекс - 5. Напишите программу, еоторая по имени показывает
# оценку. На вход программа получает имя
# dict = {"Pol": 4, "Ann": 4, "Alex": 5}
# name = input()
# for k, v in dict.items():
#     if k == name:
#         print(v)


# 8.4 Дан словарь, выведите на экран произведение всех значений словаря
# dic = {"data1": 135, "data2": 567, "data3": -37, "data4": 21}
# n = 1
# for v in dic.values():
#     n *= v
# print(n)

# 8.1 Создайте словарь person, в котором будут ключи name, age, city. Выведите значение возраста
# person = {"name": "Kate", "age": 18, "city": "Minsk"}
# print(person["age"])
# print(person.get("age"))

# 8.2 Программа принимает список из 3 слов. Создать словарь, в которов ключ - слово, значение - кол-во символов в слове
lst1 = input()
for a in lst1:
    d = {a: }
    a.count()
lst1 = ["one", "two", "three"]
print(dict(zip(lst1, lst2)))

# !!!!!!!!!!!!!!!!!!!!!!8.3 На вход подается список чисел. Создать словарь, в котором ключ - число, значение - число на 10 % большн ключа.
# Значение должно быть округленное.
# lst = int(input())
# dict = {a: a + 0.01 for a in lst}
# print(dict)

# 8.4 Создайте следующий словарь: ключ - BMV, Tesla, значения - список из трех моделей. Выведите первое и последнее значения
# каждого из ключей
# dict = {"BMV": ["model1", "model2", "model3"], "Tesla": ["model1", "model2", "model3"]}
# print(dict["BMV"][0], dict["BMV"][2])
# print(dict["Tesla"][0], dict["Tesla"][2])


# 8.5 Написать задачу со словарем. Задача должна содержать условие и решение
# problem = {"Kate": 6, "Ann": 3, "Condition":" How many apples have they taken", "Solution": 9}


# x = ["ab", "cd"]
# for i in x:
#     x.append(i.upper())
# print(x)




